In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "değer1":[10,20,34,45,54,54],
                   "değer2":[102,203,344,455,546,546]})
df

  gruplar  değer1  değer2
0       A      10     102
1       B      20     203
2       C      34     344
3       A      45     455
4       B      54     546
5       C      54     546

In [2]:
df.groupby("gruplar").apply(np.sum)

        gruplar  değer1  değer2
gruplar
A            AA      55     557
B            BB      74     749
C            CC      88     890

In [3]:
def fonk(df):
    df2 = df.min()
    return df2
fonk(df)

gruplar      A
değer1      10
değer2     102
dtype: object

In [4]:
def fonk2(df):
    df2 = df.std()
    return df2
fonk2(df)

değer1     18.247374
değer2    184.103232
dtype: float64

In [5]:
df.apply({"değer1":fonk,"değer2":fonk2})

değer1     10.000000
değer2    184.103232
dtype: float64

In [8]:
df.apply({"gruplar":lambda x: x*2}).groupby("gruplar").sum()

Empty DataFrame
Columns: []
Index: [AA, BB, CC]